package unk.a.a;

import java.util.BitSet;

class d
{
  private static void a(a parama1, b paramb, a parama2, BitSet paramBitSet1, BitSet paramBitSet2)
  {
    String[] arrayOfString = { "^", " ̂", "K", "_", " ̲", "K", "`", " ̀", "K", " ", " ", "K", "¨", " ̈", "K", "ª", "a", "K", "¯", " ̄", "K", "²", "2", "K", "³", "3", "K", "´", " ́", "K", "µ", "μ", "K", "¸", " ̧", "K", "¹", "1", "K", "º", "o", "K", "¼", "1⁄4", "K", "½", "1⁄2", "K", "¾", "3⁄4", "K", "À", "À", "", "Á", "Á", "", "Â", "Â", "", "Ã", "Ã", "", "Ä", "Ä", "", "Å", "Å", "", "Ç", "Ç", "", "È", "È", "", "É", "É", "", "Ê", "Ê", "", "Ë", "Ë", "", "Ì", "Ì", "", "Í", "Í", "", "Î", "Î", "", "Ï", "Ï", "", "Ñ", "Ñ", "", "Ò", "Ò", "", "Ó", "Ó", "", "Ô", "Ô", "", "Õ", "Õ", "", "Ö", "Ö", "", "Ù", "Ù", "", "Ú", "Ú", "", "Û", "Û", "", "Ü", "Ü", "", "Ý", "Ý", "", "à", "à", "", "á", "á", "", "â", "â", "", "ã", "ã", "", "ä", "ä", "", "å", "å", "", "ç", "ç", "", "è", "è", "", "é", "é", "", "ê", "ê", "", "ë", "ë", "", "ì", "ì", "", "í", "í", "", "î", "î", "", "ï", "ï", "", "ñ", "ñ", "", "ò", "ò", "", "ó", "ó", "", "ô", "ô", "", "õ", "õ", "", "ö", "ö", "", "ù", "ù", "", "ú", "ú", "", "û", "û", "", "ü", "ü", "", "ý", "ý", "", "Ă", "Ă", "", "ă", "ă", "", "Ĩ", "Ĩ", "", "ĩ", "ĩ", "", "Ũ", "Ũ", "", "ũ", "ũ", "", "Ơ", "Ơ", "", "ơ", "ơ", "", "Ư", "Ư", "", "ư", "ư", "", "Ạ", "Ạ", "", "ạ", "ạ", "", "Ả", "Ả", "", "ả", "ả", "", "Ấ", "Ấ", "", "ấ", "ấ", "", "Ầ", "Ầ", "", "ầ", "ầ", "", "Ẩ", "Ẩ", "", "ẩ", "ẩ", "", "Ẫ", "Ẫ", "", "ẫ", "ẫ", "", "Ậ", "Ậ", "", "ậ", "ậ", "", "Ắ", "Ắ", "", "ắ", "ắ", "", "Ằ", "Ằ", "", "ằ", "ằ", "", "Ẳ", "Ẳ", "", "ẳ", "ẳ", "", "Ẵ", "Ẵ", "", "ẵ", "ẵ", "", "Ặ", "Ặ", "", "ặ", "ặ", "", "Ẹ", "Ẹ", "", "ẹ", "ẹ", "", "Ẻ", "Ẻ", "", "ẻ", "ẻ", "", "Ẽ", "Ẽ", "", "ẽ", "ẽ", "", "Ế", "Ế", "", "ế", "ế", "", "Ề", "Ề", "", "ề", "ề", "", "Ể", "Ể", "", "ể", "ể", "", "Ễ", "Ễ", "", "ễ", "ễ", "", "Ệ", "Ệ", "", "ệ", "ệ", "", "Ỉ", "Ỉ", "", "ỉ", "ỉ", "", "Ị", "Ị", "", "ị", "ị", "", "Ọ", "Ọ", "", "ọ", "ọ", "", "Ỏ", "Ỏ", "", "ỏ", "ỏ", "", "Ố", "Ố", "", "ố", "ố", "", "Ồ", "Ồ", "", "ồ", "ồ", "", "Ổ", "Ổ", "", "ổ", "ổ", "", "Ỗ", "Ỗ", "", "ỗ", "ỗ", "", "Ộ", "Ộ", "", "ộ", "ộ", "", "Ớ", "Ớ", "", "ớ", "ớ", "", "Ờ", "Ờ", "", "ờ", "ờ", "", "Ở", "Ở", "", "ở", "ở", "", "Ỡ", "Ỡ", "", "ỡ", "ỡ", "", "Ợ", "Ợ", "", "ợ", "ợ", "", "Ụ", "Ụ", "", "ụ", "ụ", "", "Ủ", "Ủ", "", "ủ", "ủ", "", "Ứ", "Ứ", "", "ứ", "ứ", "", "Ừ", "Ừ", "", "ừ", "ừ", "", "Ử", "Ử", "", "ử", "ử", "", "Ữ", "Ữ", "", "ữ", "ữ", "", "Ự", "Ự", "", "ự", "ự", "", "Ỳ", "Ỳ", "", "ỳ", "ỳ", "", "Ỵ", "Ỵ", "", "ỵ", "ỵ", "", "Ỷ", "Ỷ", "", "ỷ", "ỷ", "", "Ỹ", "Ỹ", "", "ỹ", "ỹ", "" };
    int[] arrayOfInt = { 768, 230, 769, 230, 770, 230, 771, 230, 772, 230, 773, 230, 774, 230, 775, 230, 776, 230, 777, 230, 778, 230, 779, 230, 780, 230, 781, 230, 782, 230, 783, 230, 784, 230, 785, 230, 786, 230, 787, 230, 788, 230, 789, 232, 790, 220, 791, 220, 792, 220, 793, 220, 794, 232, 795, 216, 796, 220, 797, 220, 798, 220, 799, 220, 800, 220, 801, 202, 802, 202, 803, 220, 804, 220, 805, 220, 806, 220, 807, 202, 808, 202, 809, 220, 810, 220, 811, 220, 812, 220, 813, 220, 814, 220, 815, 220, 816, 220, 817, 220, 818, 220, 819, 220, 820, 1, 821, 1, 822, 1, 823, 1, 824, 1, 825, 220, 826, 220, 827, 220, 828, 220, 829, 230, 830, 230, 831, 230, 832, 230, 833, 230, 834, 230, 835, 230, 836, 230, 837, 240, 864, 234, 865, 234 };
    int i = 0;
    int j = arrayOfString.length;
    int k = 0;
    label4672: int m;
    int n;
    int i1;
    if (i >= j)
    {
      if (k < arrayOfInt.length);
    }
    else
    {
      m = arrayOfString[i].charAt(0);
      String str = arrayOfString[(i + 1)];
      boolean bool = arrayOfString[(i + 2)].equals("K");
      if (bool)
        paramBitSet1.set(m);
      paramb.e(m, str);
      if (!bool)
      {
        n = str.charAt(0);
        if (str.length() <= 1)
          break label4817;
        i1 = str.charAt(1);
      }
    }
    while (true)
    {
      parama2.put(i1 | n << 16, m);
      i += 3;
      break;
      int i2 = k + 1;
      int i3 = arrayOfInt[k];
      k = i2 + 1;
      parama1.put(i3, arrayOfInt[i2]);
      break label4672;
      label4817: i1 = n;
      n = 0;
    }
  }

  static e aC(boolean paramBoolean)
  {
    a locala1 = new a(0);
    b localb = new b(null);
    a locala2 = new a(65535);
    BitSet localBitSet1 = new BitSet();
    BitSet localBitSet2 = new BitSet();
    a(locala1, localb, locala2, localBitSet1, localBitSet2);
    return new e(locala1, localb, locala2, localBitSet1, localBitSet2);
  }
}

/* Location:           /home/danghvu/0day/Zalo/Zalo_1.0.8_dex2jar.jar
 * Qualified Name:     a.a.d
 * JD-Core Version:    0.6.2
 */